{"slug":"shakira","title":"Todo lo que necesitas saber acerca de la Reina de la Música Latina: Shakira","description":"Shakira es una cantante, compositora, productora discográfica, bailarina, empresaria y embajadora de buena voluntad. Su música abarca géneros como el pop, rock, latin, flamenco, hip-hop y r&b. Descubre aquí su exitosa carrera musical.","image":"https://res.cloudinary.com/dv1gxwa7v/image/upload/v1611683278/shakira_nq3bq3.jpg","content":"<p>Shakira Isabel Mebarak Ripoll, conocida simplemente como Shakira, es una cantante, compositora, productora discográfica, bailarina, empresaria y embajadora de buena voluntad colombiana. Su música abarca géneros como el pop, rock, latin, flamenco, hip-hop y r&b. Desde el comienzo de su carrera musical, Shakira ha vendido más de 140 millones de discos en todo el mundo, lo que la convierte en una de las artistas latinoamericanas más vendidas de todos los tiempos. En 2010, fue nombrada por la revista Billboard como la mayor artista latina de la década. </p><h2>Primeros años</h2><p>Nacida el 2 de febrero de 1977 en Barranquilla, Colombia, Shakira comenzó a componer canciones a la edad de 8 años. A los 10 años, publicó su primera canción titulada “Tus Gafas Oscuras”. En 1991, a los 13 años, lanzó su primer álbum llamado Magia, el cual fue un éxito en Colombia. El álbum contenía temas como “Magia”, “Dónde Estás Corazón” y “Estoy Aquí”, canciones que reflejaban su experiencia personal y su amor por la música. </p><h2>Carrera musical</h2><p>En 1995, Shakira lanzó su segundo álbum, Pies Descalzos, que se convirtió en un éxito internacional. El álbum contenía temas como “Antología”, “Ciega, Sordomuda” y “Ojos Así”. En 2001, Shakira lanzó su tercer álbum, Laundry Service, que fue un gran éxito en todo el mundo. El álbum contenía canciones como “Whenever, Wherever”, “Objection (Tango)” y “Underneath Your Clothes”. Las canciones del álbum se convirtieron en éxitos mundiales y ayudaron a consolidar a Shakira como una de las vocalistas más exitosas del planeta. Desde entonces, Shakira ha lanzado una serie de álbumes de éxito, entre los que se destacan She Wolf (2009), Sale el Sol (2010), Shakira (2014) y El Dorado (2017). </p><h2>Logros</h2><p>Shakira ha recibido numerosos premios y reconocimientos a lo largo de su carrera musical. Entre ellos se encuentran dos Premios Grammy, ocho Premios Latin Grammy, cuatro MTV Video Music Awards, tres American Music Awards y dos Billboard Music Awards. También ha sido nombrada por la revista Time como una de las 100 personas más influyentes del mundo. Además, Shakira es embajadora de buena voluntad de la UNICEF desde 2003.</p>","references":["https://es.wikipedia.org/wiki/Shakira","https://www.biography.com/musician/shakira","https://www.grammy.com/grammys/artists/shakira"],"date_created":"2023-02-17T01:24:24.841Z","is_published":false}